/**
 * Функция как выражение
 * действует только после определения, в отличие от определения в декларативном стиле
 * ссылкой передается в переменную - анонимная функция, да
 * это в стиле объявления как выражение
 */

// function declaration

//  function expression
 let getSquare = function (x) {
     return
 }

// fat arrow function
/**
 * разобрали скобки, что нужно ставить ретурн, если более 1 строки и в скобках;
 * 
 * Использовать const для функций, чтобы не переопределить по ошибке
 * 
 * artuments - псевдомассив
 */

